Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8723.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATC" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LC0" edc:desc="" edc:mask="0x1" edc:name="LC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1" edc:desc="" edc:mask="0x1" edc:name="LC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC2" edc:desc="" edc:mask="0x1" edc:name="LC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3" edc:desc="" edc:mask="0x1" edc:name="LC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC4" edc:desc="" edc:mask="0x1" edc:name="LC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC5" edc:desc="" edc:mask="0x1" edc:name="LC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC6" edc:desc="" edc:mask="0x1" edc:name="LC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC7" edc:desc="" edc:mask="0x1" edc:name="LC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD7" edc:desc="" edc:mask="0x1" edc:name="LATD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LD0" edc:desc="" edc:mask="0x1" edc:name="LD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD1" edc:desc="" edc:mask="0x1" edc:name="LD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD2" edc:desc="" edc:mask="0x1" edc:name="LD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD3" edc:desc="" edc:mask="0x1" edc:name="LD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD4" edc:desc="" edc:mask="0x1" edc:name="LD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD5" edc:desc="" edc:mask="0x1" edc:name="LD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD6" edc:desc="" edc:mask="0x1" edc:name="LD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LD7" edc:desc="" edc:mask="0x1" edc:name="LD7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATE" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE2" edc:desc="" edc:mask="0x1" edc:name="LATE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE3" edc:desc="" edc:mask="0x1" edc:name="LATE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE4" edc:desc="" edc:mask="0x1" edc:name="LATE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE5" edc:desc="" edc:mask="0x1" edc:name="LATE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE6" edc:desc="" edc:mask="0x1" edc:name="LATE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE7" edc:desc="" edc:mask="0x1" edc:name="LATE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LE0" edc:desc="" edc:mask="0x1" edc:name="LE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE1" edc:desc="" edc:mask="0x1" edc:name="LE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE2" edc:desc="" edc:mask="0x1" edc:name="LE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE3" edc:desc="" edc:mask="0x1" edc:name="LE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE4" edc:desc="" edc:mask="0x1" edc:name="LE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE5" edc:desc="" edc:mask="0x1" edc:name="LE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE6" edc:desc="" edc:mask="0x1" edc:name="LE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LE7" edc:desc="" edc:mask="0x1" edc:name="LE7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATF" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATF0" edc:desc="" edc:mask="0x1" edc:name="LATF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF2" edc:desc="" edc:mask="0x1" edc:name="LATF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF3" edc:desc="" edc:mask="0x1" edc:name="LATF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF4" edc:desc="" edc:mask="0x1" edc:name="LATF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF7" edc:desc="" edc:mask="0x1" edc:name="LATF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LF0" edc:desc="" edc:mask="0x1" edc:name="LF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF1" edc:desc="" edc:mask="0x1" edc:name="LF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF2" edc:desc="" edc:mask="0x1" edc:name="LF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF3" edc:desc="" edc:mask="0x1" edc:name="LF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF4" edc:desc="" edc:mask="0x1" edc:name="LF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF5" edc:desc="" edc:mask="0x1" edc:name="LF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF6" edc:desc="" edc:mask="0x1" edc:name="LF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LF7" edc:desc="" edc:mask="0x1" edc:name="LF7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LATG" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxxxx" edc:name="LATG" edc:nzwidth="0x8" edc:por="---xxxxx" edc:_addr="0xF8F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG4" edc:desc="" edc:mask="0x1" edc:name="LATG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG5" edc:desc="" edc:mask="0x1" edc:name="LATG5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LG0" edc:desc="" edc:mask="0x1" edc:name="LG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LG1" edc:desc="" edc:mask="0x1" edc:name="LG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LG2" edc:desc="" edc:mask="0x1" edc:name="LG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LG3" edc:desc="" edc:mask="0x1" edc:name="LG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LG4" edc:desc="" edc:mask="0x1" edc:name="LG4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATH0" edc:desc="" edc:mask="0x1" edc:name="LATH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH1" edc:desc="" edc:mask="0x1" edc:name="LATH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH2" edc:desc="" edc:mask="0x1" edc:name="LATH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH3" edc:desc="" edc:mask="0x1" edc:name="LATH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH4" edc:desc="" edc:mask="0x1" edc:name="LATH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH5" edc:desc="" edc:mask="0x1" edc:name="LATH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH6" edc:desc="" edc:mask="0x1" edc:name="LATH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATH7" edc:desc="" edc:mask="0x1" edc:name="LATH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LH0" edc:desc="" edc:mask="0x1" edc:name="LH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH1" edc:desc="" edc:mask="0x1" edc:name="LH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH2" edc:desc="" edc:mask="0x1" edc:name="LH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH3" edc:desc="" edc:mask="0x1" edc:name="LH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH4" edc:desc="" edc:mask="0x1" edc:name="LH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH5" edc:desc="" edc:mask="0x1" edc:name="LH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH6" edc:desc="" edc:mask="0x1" edc:name="LH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LH7" edc:desc="" edc:mask="0x1" edc:name="LH7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATJ" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATJ" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATJ0" edc:desc="" edc:mask="0x1" edc:name="LATJ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ1" edc:desc="" edc:mask="0x1" edc:name="LATJ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ2" edc:desc="" edc:mask="0x1" edc:name="LATJ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ3" edc:desc="" edc:mask="0x1" edc:name="LATJ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ4" edc:desc="" edc:mask="0x1" edc:name="LATJ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ5" edc:desc="" edc:mask="0x1" edc:name="LATJ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ6" edc:desc="" edc:mask="0x1" edc:name="LATJ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATJ7" edc:desc="" edc:mask="0x1" edc:name="LATJ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LJ0" edc:desc="" edc:mask="0x1" edc:name="LJ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ1" edc:desc="" edc:mask="0x1" edc:name="LJ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ2" edc:desc="" edc:mask="0x1" edc:name="LJ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ3" edc:desc="" edc:mask="0x1" edc:name="LJ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ4" edc:desc="" edc:mask="0x1" edc:name="LJ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ5" edc:desc="" edc:mask="0x1" edc:name="LJ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ6" edc:desc="" edc:mask="0x1" edc:name="LJ6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LJ7" edc:desc="" edc:mask="0x1" edc:name="LJ7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0xF92">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISB" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0xF93">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRB"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
